Troughput-Latency-tests/ExerciceManagerTest/exer_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/exercises
Document Length:        14 bytes

Concurrency Level:      100
Time taken for tests:   1.661 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      240000 bytes
Total body sent:        433000
HTML transferred:       14000 bytes
Requests per second:    601.92 [#/sec] (mean)
Time per request:       166.136 [ms] (mean)
Time per request:       1.661 [ms] (mean, across all concurrent requests)
Transfer rate:          141.07 [Kbytes/sec] received
                        254.52 kb/s sent
                        395.60 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45   59   9.6     56     118
Processing:    54   88  22.2     81     185
Waiting:       53   84  21.9     76     181
Total:        104  148  28.0    138     252

Percentage of the requests served within a certain time (ms)
  50%    138
  66%    147
  75%    160
  80%    165
  90%    192
  95%    209
  98%    230
  99%    234
 100%    252 (longest request)