Troughput-Latency-tests/ExerciceManagerTest/exer_150.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/exercises
Document Length:        14 bytes

Concurrency Level:      150
Time taken for tests:   1.688 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      240000 bytes
Total body sent:        433000
HTML transferred:       14000 bytes
Requests per second:    592.35 [#/sec] (mean)
Time per request:       253.227 [ms] (mean)
Time per request:       1.688 [ms] (mean, across all concurrent requests)
Transfer rate:          138.83 [Kbytes/sec] received
                        250.48 kb/s sent
                        389.31 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       44   59   6.6     57      87
Processing:    55  164  48.0    148     372
Waiting:       52  160  48.2    143     368
Total:        101  222  51.5    205     432

Percentage of the requests served within a certain time (ms)
  50%    205
  66%    222
  75%    247
  80%    268
  90%    300
  95%    332
  98%    347
  99%    362
 100%    432 (longest request)