Troughput-Latency-tests/ExerciceManagerTest/exer_30.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/exercises
Document Length:        14 bytes

Concurrency Level:      30
Time taken for tests:   4.100 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      240000 bytes
Total body sent:        433000
HTML transferred:       14000 bytes
Requests per second:    243.92 [#/sec] (mean)
Time per request:       122.989 [ms] (mean)
Time per request:       4.100 [ms] (mean, across all concurrent requests)
Transfer rate:          57.17 [Kbytes/sec] received
                        103.14 kb/s sent
                        160.31 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       44   53   3.1     53      67
Processing:    50   64   9.6     61     106
Waiting:       49   62   9.4     59     104
Total:         98  117  11.0    115     164

Percentage of the requests served within a certain time (ms)
  50%    115
  66%    119
  75%    122
  80%    124
  90%    130
  95%    141
  98%    153
  99%    156
 100%    164 (longest request)