Troughput-Latency-tests/ExerciceManagerTest/exer_40.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/exercises
Document Length:        14 bytes

Concurrency Level:      40
Time taken for tests:   3.409 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      240000 bytes
Total body sent:        433000
HTML transferred:       14000 bytes
Requests per second:    293.31 [#/sec] (mean)
Time per request:       136.373 [ms] (mean)
Time per request:       3.409 [ms] (mean, across all concurrent requests)
Transfer rate:          68.75 [Kbytes/sec] received
                        124.03 kb/s sent
                        192.77 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45   53   3.2     53      66
Processing:    49   76  19.8     71     152
Waiting:       49   74  19.8     69     148
Total:         99  130  20.7    125     212

Percentage of the requests served within a certain time (ms)
  50%    125
  66%    133
  75%    140
  80%    143
  90%    156
  95%    173
  98%    193
  99%    200
 100%    212 (longest request)